import { CubePrice } from "types/cube";

export const cubePotentialPrice: CubePrice = {
  250: { 레전드리: 50000000, 유니크: 42500000, 에픽: 20000000, 레어: 5000000 },
  200: { 레전드리: 45000000, 유니크: 38250000, 에픽: 18000000, 레어: 4500000 },
  160: { 레전드리: 42500000, 유니크: 36125000, 에픽: 17000000, 레어: 4250000 },
  1: { 레전드리: 40000000, 유니크: 34000000, 에픽: 16000000, 레어: 4000000 },
};

export const cubeAdditionalPotentialPrice: CubePrice = {
  250: { 레전드리: 65000000, 유니크: 55250000, 에픽: 45500000, 레어: 16250000 },
  200: { 레전드리: 58500000, 유니크: 49725000, 에픽: 40950000, 레어: 14625000 },
  160: { 레전드리: 55250000, 유니크: 46962500, 에픽: 38675000, 레어: 13812000 },
  1: { 레전드리: 52000000, 유니크: 44200000, 에픽: 36400000, 레어: 13000000 },
};
